app/controllers/articles_controller.rb

  def update
    @article.update(params[:article])
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-01-16 01:51:25.351938"], ["id", 1]]